

# ------------------------------------
# 定数
# ------------------------------------
class Conf
  
  # ------------------------------------
  # コンストラクタ
  # ------------------------------------
  constructor: ->
    
    # 本番フラグ
    # -------------------------------
    @RELEASE = true;
    # -------------------------------
    
    # フラグ関連
    @FLG = {
      LOG:true,  # ログ出力
      PARAM:true, # パラメータチェック
      STATS:true  # Stats表示
    };
    
    # 本番フラグがtrueの場合、フラグ関連は全てfalseに
    if @RELEASE
      for key,val of @FLG
        @FLG[key] = false;





module.exports = Conf;
